/*
TUES http://www.elsys-bg.org/
11б
N.10
Георги Миленов Цанев
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 числа на Фибоначи в [0; +∞), които се делят на x без остатък. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
*/

#include<stdio.h>

int main() {
	int x, i, arr[10];
	while ((x<0) || (x>=10)) {
	pritnf("Vavedete x: ");	
	scanf("%d", &x);
	}

	int s, d, f, c;
		s=0; d=1; f=0;
	while(f<10){
		c=s+d;
		s=d;
		d=c;
		if ((c>=0) && (c%x == 0)){
			arr[f]=c;		
			f++;
		}
	}

	for(i=0; i<10; i++){
		printf("%d ", arr[i]);
	}
		printf("\n");
}
