/*
TUES http://www.elsys-bg.org/
11б
N.10
Георги Миленов Цанев
Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>
#include<math.h>

int main() {
	int x, y, z, n, i, s, f, arr[10];
	while ((x<=0) || (x>=10)) {
	printf("Vavedete x: ");	
	scanf("%d", &x);
	}

	i=0;
	for(n=0; n<10; n++) {
		for(y=n; y<((n+1)*x); y++) {
			s=y*x;
			for(f=s; f<((y+1)*x); f++)	{
				i=cos(f+i) + i;
			}
			arr[y]=i;
		}
	}
	
	for(i=0; i<10; i++){
		printf("%d ", arr[i]);
	}
	printf("\n");
}

