/*
TUES http://www.elsys-bg.org/
11б
N.10
Георги Миленов Цанев
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала[0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main() {
	int x, y, i, z, c=0, arr[10];
	while ((x<=0) || (x>=10)) {
	printf("Vavedete x: ");	
	scanf("%d", &x);
	}
	
	y=0;
	for(z=1;z<=10;z++) {
		for(i=0; i<1000; i++) {
			if (i%(z*x) == 0) c = i + c;
		}
		arr[y]=c;
		y++;
	}

	for(i=0; i<10; i++){
		printf("%d ", arr[i]);
	}
	printf("\n");
}
