/*
TUES http://www.elsys-bg.org/
11б
N.10
Георги Миленов Цанев
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0; +∞) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0; +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main() {
	int x, y, z, n, i, result, arr[10];
	while ((x<=0) || (x>=10)) {
	printf("Vavedete x: ");	
	scanf("%d", &x);
	}

	y=0;
	n=0;
	for(i=0; y<10; i++) {
		result = check_prime(i);
		if (result == 1) {
			z=x+10*n;
			result = check_prime(z);
			if (result == 1) {
				if (i == z) {
					arr[y] = i;
					n++;
					y++;
				}
			}
			else n++;
		}
	}

	for(i=0; i<10; i++){
		printf("%d ", arr[i]);
	}
	printf("\n");
}

int check_prime(int a) {
	int b;
	for ( b = 2 ; b <= a - 1 ; b++ ) {
		if ( a%b == 0 )
		return 0;
	}
	if ( b == a )
		return 1;
}
